app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "get in dat"], ["created_at", Mon, 06 Jan 2014 20:24:29 UTC +00:00], ["title", "whaa"], ["updated_at", Mon, 06 Jan 2014 20:24:29 UTC +00:00]]