app/controllers/winks_controller.rb

  def index
    @winks = Wink.all
---
SELECT "winks".* FROM "winks"

  def create
    @wink = Wink.new(params[:wink])

    respond_to do |format|
      if @wink.save
---
INSERT INTO "winks" ("created_at", "giver", "receiver", "subtext", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 06 Jan 2014 22:06:51 UTC +00:00], ["giver", "Sarah"], ["receiver", "Nisha"], ["subtext", "Gimme dat suga."], ["updated_at", Mon, 06 Jan 2014 22:06:51 UTC +00:00]]

  def show
    @wink = Wink.find(params[:id])
---
SELECT "winks".* FROM "winks" WHERE "winks"."id" = ? LIMIT 1  [["id", "17"]]

  def destroy
    @wink = Wink.find(params[:id])
    @wink.destroy
---
SELECT "winks".* FROM "winks" WHERE "winks"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "winks" WHERE "winks"."id" = ?  [["id", 1]]